machdyne/zeitlos/sw/apps/net/esp32link.c
/*
 * Zeitlos -- UART PHY to the onboard ESP32 (ULX3S).
 *
 * Third NIC backend (NET_PHY=ESP32LINK). Speaks ZNIC over UART1;
 * 802.11 stays on the ESP32. See docs/esp32link.md and znic.h.
 *
 * Transport model (fw ver 2): every frame the ESP32 sends is the
 * reply to one frame we sent. RX_POLL is answered with the oldest
 * queued control message (HELLO, LINK, LOG), else a DATA frame, else
 * NOP; DATA is answered with DATA_ACK; STA with STA_ACK. Replies are
 * read from rtl/esp32_rxfifo.v, a 2 KiB block-RAM FIFO on the UART1
 * RX pin (the 16550's 16 bytes could not survive a time slice: at
 * 1 Mbaud, ~4 ms away from the CPU is 400 bytes). So nothing here
 * masks interrupts, and a reply that comes late is never thrown away:
 * whatever is in the FIFO is dispatched before the next request goes
 * out, and the ESP32 always answers in order. TX still uses the 16550.
 */

#include <stdio.h>
#include <stdint.h>
#include <string.h>

#include "../../common/zeitlos.h"
#include "esp32link.h"
#include "znic.h"
#include "netprof.h"
#include "screen.h"
#include "netcfg.h"
#include "../../common/zfsapp.h"	/* fs_write_file() -- NET.IP on the SD */

#define UART1_LSR_DR    0x01
#define UART1_LSR_THRE  0x20
#define UART1_BAUD_DIV  1	/* 48 MHz / 1 / 16 = 3 Mbaud -- the 16550's ceiling,
				   and rtl/esp32_rxfifo.v samples at CLK_PER_BIT 16 */

#define TICKS_PER_SEC   732
#define LINK_TIMEOUT    (40 * TICKS_PER_SEC)
#define HELLO_BURST     (3 * TICKS_PER_SEC)	/* a HELLO later than this
						   after the first one = the
						   ESP32 rebooted */
#define PROBE_INTERVAL  (TICKS_PER_SEC / 20)	/* ~50 ms between polls
						   while no HELLO yet */
#define STA_RETRY_GAP   (1 * TICKS_PER_SEC)
#define STA_MAX_TRIES   5

/* rtl/esp32_rxfifo.v */
#define reg_esp32rx_count (*(volatile uint32_t*)0xf0000300)
#define reg_esp32rx_data  (*(volatile uint32_t*)0xf0000304)
#define reg_esp32rx_flush (*(volatile uint32_t*)0xf0000308)

#define REPLY_TICKS     30	/* ~40 ms for the ESP32 to start answering
				   (normally < 1 ms; tcpip/wifi can delay it) */

/* ---- how often to poll ---------------------------------------------
 *
 * The ESP32 answers, it does not speak first -- with two exceptions,
 * and they are the ones that decide this. Browser keyboard and mouse
 * events are pushed the moment they arrive (screend.c's ws_handler
 * calls znic_send directly, not the poll queue), and so is DATA_ACK.
 * Both land in the BRAM receive FIFO on their own, and an arrival there
 * raises Z_IRQ_ETH, which the kernel turns into an unblock of net0. So
 * the interactive path -- the one that made this loop poll fast in the
 * first place -- does not need a poll at all.
 *
 * What does still wait for an RX_POLL is an incoming LAN frame and the
 * queued control messages (HELLO, LINK, LOG). Polling every kernel tick
 * for those meant 732 round trips a second, nearly all answered NOP,
 * and -- far more expensive than the round trips -- net permanently in
 * the runnable set, which on a round-robin scheduler is a whole share
 * of the CPU taken from whatever is painting.
 *
 * So the poll runs on a deadline that follows the traffic:
 *
 *   - a conversation is live (a DATA frame arrived within the last
 *     LINK_BUSY_HOLD, or the wifi bring-up has not finished): every
 *     tick, exactly as before, so telnet and TFTP keep their latency
 *     and their throughput;
 *   - otherwise the same 100 ms backstop the wired backends use.
 *
 * Only the FIRST inbound packet after two seconds of silence pays that
 * backstop, because it is itself what switches this back to fast. A
 * ping to an idle board can therefore show one slow reply and then a
 * run of quick ones; that is the whole visible cost. */
#define POLL_GAP_BUSY   1
#define POLL_GAP_IDLE   (TICKS_PER_SEC / 10)
#define LINK_BUSY_HOLD  (2 * TICKS_PER_SEC)
#define PROBE_TICKS     4	/* while the ESP32 may still be booting */
#define BYTE_TICKS      3	/* ~4 ms between bytes of one frame (10 us
				   apart on the wire) */

#define ESP32_CTL_EN    0x1
#define ESP32_CTL_GPIO0 0x2

/* last reply pulled off the wire */
static uint8_t rx_msg[ZNIC_MAX_PAYLOAD];
static uint16_t rx_msg_len;
static uint8_t rx_msg_type;

/* link state, owned by znic_dispatch() */
static int hello_ok;
static int hello_count;
static uint8_t peer_fw;
static uint8_t peer_rst;
static uint32_t first_hello_tick;
static int sta_acked;
static uint8_t sta_status;
static int link_up;
static int last_rssi;
static uint8_t last_reason;
static uint8_t last_scan;
// Station (LAN) address the ESP32 got, host order; 0 until LINK
// reports up. This is the address to point a LAN-side client at.
static uint32_t sta_ip;
static uint32_t crc_errors;
static uint32_t data_dropped;
static uint32_t polls_sent;
static uint32_t polls_unanswered;
static uint32_t nops_rx;
static uint32_t logs_rx;
static uint32_t data_rx;
static uint32_t late_rx;
static uint32_t fifo_overruns;

/* -- TX window (znic v3) --
 * DATA is no longer stop-and-wait: up to ZNIC_TX_WINDOW frames may be
 * in flight, each still answered by a DATA_ACK (dispatched wherever it
 * happens to be read). A full window waits briefly for ack progress;
 * on timeout the count resets and the frames are presumed lost, which
 * is what an ethernet link is allowed to do -- TCP/TFTP retransmit. */
#define ZNIC_TX_WINDOW 4
static uint32_t tx_outstanding;
static uint32_t tx_lost;
static uint32_t bursts_rx;
static uint8_t peer_mac[6];

/* small DATA ring: filled by znic_dispatch(), drained by
 * esp32link_recv(). More than one slot because late replies drained
 * ahead of a request can carry several frames. */
#define RX_RING 16
static uint8_t rx_data[RX_RING][ZNIC_MAX_PAYLOAD];
static uint16_t rx_data_len[RX_RING];
static int rx_head, rx_tail, rx_count;
#define rx_data_pending (rx_count > 0)

/* wifi bring-up state machine, driven by esp32link_poll_wifi() */
enum { PH_HELLO = 0, PH_SEND_STA, PH_WAIT_LINK, PH_DONE };
static int phase;
static uint32_t sta_sent_tick;
static int sta_tries;
static int link_timeout_reported;
static uint32_t last_poll_tick;
static uint32_t link_busy_tick;
static int poll_productive;	/* last reply was not NOP: ask again at once */

/* visor / USB mouse coexistence (reg_vmouse bit 24).
 * net used to OR present on every ZNIC_MOUSE and never clear it, so a
 * single visor (or mouse_ws) packet froze the USB pointer until the
 * FPGA was reset. Last writer wins: a visor packet takes the sprite,
 * visor silence of ~1 s (tab closed, pointer left the canvas, synthetic
 * mouse stopped) drops present so the USB mux in rtl/sysctl.v wins
 * without a wiggle. wm also clears present on a USB move. buttons bit 7
 * is an explicit leave from the visor page / mouse_ws release. */
#define VMOUSE_HOLD_TICKS  TICKS_PER_SEC
static uint32_t vmouse_last_tick;
static int vmouse_held;
static uint32_t input_events;	/* ZNIC_MOUSE + ZNIC_INPUT dispatched */

