machdyne/zeitlos/sw/apps/net/esp32link.c
static void vmouse_release(void)
{
	reg_vmouse = 0;
	vmouse_held = 0;
	/* wm sleeps until HID or this poke — dropping present must
	 * wake it so a held button is not stuck down. */
	z_wm_wake();
}

static void vmouse_release_if_stale(void)
{
	if (!vmouse_held)
		return;
	if ((int32_t)(z_uptime_ticks() - vmouse_last_tick) < (int32_t)VMOUSE_HOLD_TICKS)
		return;
	vmouse_release();
}

/* ---- is anybody watching? ------------------------------------------
 *
 * screen.c must not hash and ship the framebuffer to a gateway nobody
 * is reading it from, and net cannot see the WebSocket: it terminates
 * on the ESP32, in screend.c. What DOES cross the link is that
 * firmware's own log -- every ESP_LOG line is framed as ZNIC_LOG and
 * printed here as "esp32: ..." -- and screend logs "viewer connected
 * (fd N)" and "viewer gone (fd N)" for exactly these two events, the
 * second one also when its once-a-second keepalive to an idle client
 * fails. So the count is kept from those lines.
 *
 * That is a string match on another program's log messages, which is
 * not a contract, so it has a floor under it: any keyboard or mouse
 * event from the browser also counts as a viewer for the next
 * VIEWER_INPUT_HOLD. A missed "connected" therefore means a picture
 * that is frozen until the pointer moves, never one that stays
 * frozen; a missed "gone" means streaming to nobody until the next
 * connect, which is what it did all the time before.
 *
 * The clean version is a ZNIC control message from screend saying how
 * many clients it has. It needs the ESP32 reflashed (SD out, passthru
 * bitstream -- docs/esp32link-architecture.md), so it waits for the
 * next time that has to happen anyway.
 */
#define VIEWER_INPUT_HOLD  (30 * TICKS_PER_SEC)
#define VIEWER_MAX         8	/* screend.c's MAX_CLIENTS */
/* The fds themselves, not a count. screend hands the same fd back to the
 * next viewer (every reconnect in a measurement run said "fd 59"), and a
 * browser that closes cleanly produces no "gone" line at all -- its slot is
 * freed a second later when the keepalive to it fails. Counting up on
 * connect and down on gone therefore drifted upwards, one per reconnect,
 * until net believed somebody was always watching. Holding the fds makes a
 * repeat of one we already have a no-op, which is what it is. */
static int viewer_fd[VIEWER_MAX];
static int viewers;
static uint32_t viewer_input_tick;
static int viewer_input_seen;

static void viewer_add(int fd)
{
	for (int i = 0; i < viewers; i++)
		if (viewer_fd[i] == fd)
			return;
	if (viewers < VIEWER_MAX)
		viewer_fd[viewers++] = fd;
}

static void viewer_del(int fd)
{
	for (int i = 0; i < viewers; i++) {
		if (viewer_fd[i] != fd)
			continue;
		viewer_fd[i] = viewer_fd[--viewers];
		return;
	}
}

static void viewer_input(void)
{
	viewer_input_tick = z_uptime_ticks();
	viewer_input_seen = 1;
}

static int viewer_present(void)
{
	if (viewers)
		return 1;
	if (!viewer_input_seen)
		return 0;
	if ((z_uptime_ticks() - viewer_input_tick) < VIEWER_INPUT_HOLD)
		return 1;
	viewer_input_seen = 0;
	return 0;
}

/* Offset just past `needle` in a non-terminated payload, or -1. */
static int msg_find(const uint8_t *h, uint16_t n, const char *needle)
{
	uint16_t m = (uint16_t)strlen(needle);
	if (!m || n < m)
		return -1;
	for (uint16_t i = 0; i + m <= n; i++)
		if (!memcmp(h + i, needle, m))
			return (int)(i + m);
	return -1;
}

/* the "(fd 59)" that screend puts at the end of both of its lines */
static int msg_fd(const uint8_t *h, uint16_t n, int from)
{
	int i = msg_find(h + from, (uint16_t)(n - from), "fd ");
	if (i < 0)
		return -1;
	i += from;
	int v = 0, got = 0;
	for (; i < n && h[i] >= '0' && h[i] <= '9'; i++, got = 1)
		v = v * 10 + (h[i] - '0');
	return got ? v : -1;
}

/* ---- RX FIFO (BRAM) ---------------------------------------------- */

static inline uint32_t rx_avail(void)
{
	return reg_esp32rx_count & 0x3fff;
}

static inline int rx_overrun(void)
{
	return (reg_esp32rx_count >> 12) & 1;
}

/* Wait until the FIFO has a byte, or `ticks` kernel ticks pass.
 *
 * z_uptime_ticks() is a syscall (sw/common/zeitlos.c), and calling it
 * on every turn of a busy-wait was an early bug: each one enters the
 * kernel and can cost up to a tick to return, so a wait of a few dozen
 * iterations turned into tens of milliseconds, dropping net's poll loop
 * to ~16Hz and the remote desktop to ~1s of lag. Hence the short pure
 * MMIO burst before any syscall.
 *
 * But the burst used to be the WHOLE wait: 2048 MMIO reads between
 * clock checks, repeated for up to REPLY_TICKS. A poll's round trip is
 * the ESP32's task-switch plus a couple of ZNIC frames on the wire --
 * a few hundred microseconds in which net held the CPU and did nothing
 * with it. On a round-robin scheduler that time comes straight out of
 * whatever is painting: measured at 80-120us per character cell of a
 * terminal redraw.
 *
 * It does not have to. rtl/esp32_rxfifo.v raises rx_ready the instant
 * the first byte of the reply lands, rtl/sysctl.v edge-detects that
 * into the cpu_irq[8] pulse, and the kernel's Z_IRQ_ETH handler
 * unblocks net0 (sw/os/kernel.c) -- recording the wakeup in
 * Z_PROC_FLAG_WAKE if it arrives before we are actually blocked, so it
 * cannot be lost. So: a short spin catches a reply already on the wire
 * without paying a syscall, and anything longer becomes z_proc_wait(1)
 * -- out of the runnable set, woken by the arrival itself rather than
 * by the timeout.
 *
 * The spin stays as the floor rather than being removed: z_proc_wait()
 * returns immediately when a message is pending in net's mailbox (it
 * must -- otherwise the message would sit unread), and without the
 * MMIO burst in front of it this loop would become a syscall storm in
 * exactly that case.
 */
#define SPINS 256
static int rx_wait(uint32_t ticks)
{
	uint32_t start = z_uptime_ticks();
	for (;;) {
		for (uint32_t n = 0; n < SPINS; n++)
			if (rx_avail())
				return 1;
		if (z_uptime_ticks() - start >= ticks)
			return rx_avail() != 0;
		z_proc_wait(1);
	}
}

