machdyne/zeitlos/sw/apps/net/esp32link.c
/* one byte within `ticks` kernel ticks; data-ready is checked before
 * the clock so the fast path is a single MMIO read */
static int rx_getc_ticks(uint8_t *c, uint32_t ticks)
{
	if (!rx_avail() && !rx_wait(ticks))
		return 0;
	*c = (uint8_t)reg_esp32rx_data;
	return 1;
}

/* 16550 TX FIFO is 16 bytes; THRE means the FIFO is empty, so fill it
 * in one go instead of waiting for empty after every byte. A drag
 * stripe is ~400-800 compressed bytes; this is the 968 cyc/byte half
 * of screen_poll. */
#define UART1_TX_FIFO 16
static void uart1_write(const uint8_t *p, unsigned n)
{
	unsigned bytes = n, chunks = 0, spin = 0;
	(void)bytes; (void)chunks; (void)spin;
	while (n) {
		while ((reg_uart1_lsr & UART1_LSR_THRE) == 0)
			spin++;
		unsigned chunk = n < UART1_TX_FIFO ? n : UART1_TX_FIFO;
		for (unsigned i = 0; i < chunk; i++)
			reg_uart1_data = p[i];
		p += chunk;
		n -= chunk;
		chunks++;
	}
	NP_UART(bytes, chunks, spin);
}

/* CRC-16/CCITT (poly 0x1021, init 0xFFFF) matching znic_crc16() in
 * znic.h, table-driven so a 500-byte DATA frame is 500 lookups instead
 * of 4000 bit loops. Verified off the board against the bit version. */
static const uint16_t crc16tab[256] = {
	0x0000, 0x1021, 0x2042, 0x3063, 0x4084, 0x50a5, 0x60c6, 0x70e7,
	0x8108, 0x9129, 0xa14a, 0xb16b, 0xc18c, 0xd1ad, 0xe1ce, 0xf1ef,
	0x1231, 0x0210, 0x3273, 0x2252, 0x52b5, 0x4294, 0x72f7, 0x62d6,
	0x9339, 0x8318, 0xb37b, 0xa35a, 0xd3bd, 0xc39c, 0xf3ff, 0xe3de,
	0x2462, 0x3443, 0x0420, 0x1401, 0x64e6, 0x74c7, 0x44a4, 0x5485,
	0xa56a, 0xb54b, 0x8528, 0x9509, 0xe5ee, 0xf5cf, 0xc5ac, 0xd58d,
	0x3653, 0x2672, 0x1611, 0x0630, 0x76d7, 0x66f6, 0x5695, 0x46b4,
	0xb75b, 0xa77a, 0x9719, 0x8738, 0xf7df, 0xe7fe, 0xd79d, 0xc7bc,
	0x48c4, 0x58e5, 0x6886, 0x78a7, 0x0840, 0x1861, 0x2802, 0x3823,
	0xc9cc, 0xd9ed, 0xe98e, 0xf9af, 0x8948, 0x9969, 0xa90a, 0xb92b,
	0x5af5, 0x4ad4, 0x7ab7, 0x6a96, 0x1a71, 0x0a50, 0x3a33, 0x2a12,
	0xdbfd, 0xcbdc, 0xfbbf, 0xeb9e, 0x9b79, 0x8b58, 0xbb3b, 0xab1a,
	0x6ca6, 0x7c87, 0x4ce4, 0x5cc5, 0x2c22, 0x3c03, 0x0c60, 0x1c41,
	0xedae, 0xfd8f, 0xcdec, 0xddcd, 0xad2a, 0xbd0b, 0x8d68, 0x9d49,
	0x7e97, 0x6eb6, 0x5ed5, 0x4ef4, 0x3e13, 0x2e32, 0x1e51, 0x0e70,
	0xff9f, 0xefbe, 0xdfdd, 0xcffc, 0xbf1b, 0xaf3a, 0x9f59, 0x8f78,
	0x9188, 0x81a9, 0xb1ca, 0xa1eb, 0xd10c, 0xc12d, 0xf14e, 0xe16f,
	0x1080, 0x00a1, 0x30c2, 0x20e3, 0x5004, 0x4025, 0x7046, 0x6067,
	0x83b9, 0x9398, 0xa3fb, 0xb3da, 0xc33d, 0xd31c, 0xe37f, 0xf35e,
	0x02b1, 0x1290, 0x22f3, 0x32d2, 0x4235, 0x5214, 0x6277, 0x7256,
	0xb5ea, 0xa5cb, 0x95a8, 0x8589, 0xf56e, 0xe54f, 0xd52c, 0xc50d,
	0x34e2, 0x24c3, 0x14a0, 0x0481, 0x7466, 0x6447, 0x5424, 0x4405,
	0xa7db, 0xb7fa, 0x8799, 0x97b8, 0xe75f, 0xf77e, 0xc71d, 0xd73c,
	0x26d3, 0x36f2, 0x0691, 0x16b0, 0x6657, 0x7676, 0x4615, 0x5634,
	0xd94c, 0xc96d, 0xf90e, 0xe92f, 0x99c8, 0x89e9, 0xb98a, 0xa9ab,
	0x5844, 0x4865, 0x7806, 0x6827, 0x18c0, 0x08e1, 0x3882, 0x28a3,
	0xcb7d, 0xdb5c, 0xeb3f, 0xfb1e, 0x8bf9, 0x9bd8, 0xabbb, 0xbb9a,
	0x4a75, 0x5a54, 0x6a37, 0x7a16, 0x0af1, 0x1ad0, 0x2ab3, 0x3a92,
	0xfd2e, 0xed0f, 0xdd6c, 0xcd4d, 0xbdaa, 0xad8b, 0x9de8, 0x8dc9,
	0x7c26, 0x6c07, 0x5c64, 0x4c45, 0x3ca2, 0x2c83, 0x1ce0, 0x0cc1,
	0xef1f, 0xff3e, 0xcf5d, 0xdf7c, 0xaf9b, 0xbfba, 0x8fd9, 0x9ff8,
	0x6e17, 0x7e36, 0x4e55, 0x5e74, 0x2e93, 0x3eb2, 0x0ed1, 0x1ef0,
};

static uint16_t crc16_add(uint16_t crc, const uint8_t *p, unsigned n)
{
	while (n--)
		crc = (uint16_t)((crc << 8) ^ crc16tab[((crc >> 8) ^ *p++) & 0xff]);
	return crc;
}

static void uart1_init(void)
{
	reg_uart1_lcr = 0x83;	/* DLAB, 8N1 */
	reg_uart1_dlbh = 0;
	reg_uart1_dlbl = UART1_BAUD_DIV;
	reg_uart1_lcr = 0x03;	/* 8N1 */
	reg_uart1_fcr = 0x07;	/* FIFO on, flush both, trigger 1 */
	reg_uart1_ier = 0x00;	/* poll, no IRQ */
}

/* ---- ZNIC framing ------------------------------------------------ */

static void znic_tx_raw(uint8_t type, const uint8_t *payload, uint16_t n)
{
	uint8_t start[6];
	start[0] = ZNIC_SYNC0;
	start[1] = ZNIC_SYNC1;
	start[2] = ZNIC_VER;
	start[3] = type;
	start[4] = (uint8_t)(n & 0xFF);
	start[5] = (uint8_t)(n >> 8);
	uint16_t crc = crc16_add(0xFFFF, start + 2, 4);
	if (n && payload)
		crc = crc16_add(crc, payload, n);
	uint8_t tail[2] = { (uint8_t)(crc & 0xFF), (uint8_t)(crc >> 8) };
	uart1_write(start, 6);
	if (n && payload)
		uart1_write(payload, n);
	uart1_write(tail, 2);
}

/* one framed message: sync hunt bounded by `first` ticks, then every
 * byte within BYTE_TICKS. Returns 1 with rx_msg_* filled. */
static int znic_rx_raw(uint32_t first)
{
	uint8_t c;
	uint32_t start = z_uptime_ticks();
	int seen7e = 0;
	for (;;) {
		if (!rx_avail()) {
			uint32_t gone = z_uptime_ticks() - start;
			if (gone >= first || !rx_wait(first - gone))
				return 0;
		}
		c = (uint8_t)reg_esp32rx_data;
		if (!seen7e) {
			if (c == ZNIC_SYNC0)
				seen7e = 1;
			continue;
		}
		if (c != ZNIC_SYNC1) {
			seen7e = (c == ZNIC_SYNC0);
			continue;
		}
		break;
	}

	uint8_t hdr[4];
	for (int i = 0; i < 4; i++) {
		if (!rx_getc_ticks(&hdr[i], BYTE_TICKS))
			return 0;
	}
	uint16_t n = (uint16_t)hdr[2] | ((uint16_t)hdr[3] << 8);
	if (hdr[0] != ZNIC_VER || n > ZNIC_MAX_PAYLOAD) {
		crc_errors++;
		return 0;
	}
	for (uint16_t i = 0; i < n; i++) {
		if (!rx_getc_ticks(&rx_msg[i], BYTE_TICKS))
			return 0;
	}
	uint8_t crcl, crch;
	if (!rx_getc_ticks(&crcl, BYTE_TICKS) || !rx_getc_ticks(&crch, BYTE_TICKS))
		return 0;
	uint16_t got = (uint16_t)crcl | ((uint16_t)crch << 8);

	uint16_t cacc = znic_crc16(hdr, 4);
	for (uint16_t i = 0; i < n; i++) {
		cacc ^= (uint16_t)rx_msg[i] << 8;
		for (int b = 0; b < 8; b++)
			cacc = (cacc & 0x8000) ? (uint16_t)((cacc << 1) ^ 0x1021)
			                       : (uint16_t)(cacc << 1);
	}
	if (cacc != got) {
		crc_errors++;
		return 0;
	}
	rx_msg_type = hdr[1];
	rx_msg_len = n;
	return 1;
}

static void znic_dispatch(void);

/* whatever already sits in the FIFO is a late reply to an earlier
 * request: dispatch it, never drop it */
static void znic_drain(void)
{
	if (rx_overrun()) {
		fifo_overruns++;
		reg_esp32rx_flush = 1;	/* stream is broken anyway; clears the flag */
		return;
	}
	while (rx_avail()) {
		if (!znic_rx_raw(1))
			break;
		late_rx++;
		znic_dispatch();
	}
}

/* One transaction: drain late replies, send our frame, read one
 * reply. With `want` != 0, keep reading (dispatching the others)
 * until that type shows up. Returns the reply type or -1 on timeout.
 * Interrupts stay enabled: the BRAM FIFO holds what arrives while
 * another process runs. */
static int znic_xfer(uint8_t type, const uint8_t *payload, uint16_t n,
	uint32_t first, uint8_t want)
{
	znic_drain();
	znic_tx_raw(type, payload, n);
	uint32_t start = z_uptime_ticks();
	for (;;) {
		uint32_t left = first - (z_uptime_ticks() - start);
		if (z_uptime_ticks() - start >= first)
			return -1;
		if (!znic_rx_raw(left ? left : 1))
			return -1;
		if (!want || rx_msg_type == want)
			return (int)rx_msg_type;
		late_rx++;
		znic_dispatch();	/* a straggler; keep waiting for ours */
	}
}

/* apply the reply in rx_msg_* to the link state (prints allowed) */
static void znic_dispatch(void)
{
	switch (rx_msg_type) {

	case ZNIC_HELLO:
		hello_count++;
		if (rx_msg_len >= 6)
			memcpy(peer_mac, rx_msg, 6);
		/* flags byte = esp_reset_reason(): 1 poweron, 3 sw, 4 panic,
		 * 5 int wdt, 6 task wdt, 7 wdt, 9 brownout */
		peer_rst = (rx_msg_len >= 7) ? rx_msg[6] : 0;
		peer_fw = (rx_msg_len >= 8) ? rx_msg[7] : 0;
		if (!hello_ok) {
			hello_ok = 1;
			first_hello_tick = z_uptime_ticks();
			printf("esp32link: HELLO fw=%u rst=%u mac %02x:%02x:%02x:%02x:%02x:%02x\n",
				peer_fw, peer_rst,
				peer_mac[0], peer_mac[1], peer_mac[2],
				peer_mac[3], peer_mac[4], peer_mac[5]);
		} else if (z_uptime_ticks() - first_hello_tick > HELLO_BURST) {
			printf("esp32link: HELLO again (#%d, %lus after the first, rst=%u) "
				"-- ESP32 reset? resending STA\n", hello_count,
				(unsigned long)((z_uptime_ticks() - first_hello_tick)
					/ TICKS_PER_SEC), peer_rst);
			first_hello_tick = z_uptime_ticks();
			link_up = 0;
			sta_acked = 0;
			sta_tries = 0;
			if (phase != PH_HELLO)
				phase = PH_SEND_STA;
		}
				/* a fresh HELLO means the ESP32 (re)booted: its screen shadow
		 * is empty and its WebSocket clients are gone, so forget them
		 * and resend the whole framebuffer once one comes back */
		viewers = 0;
		screen_reset();
		break;

	case ZNIC_STA_ACK:
		sta_acked = 1;
		sta_status = (rx_msg_len >= 1) ? rx_msg[0] : 0xff;
		printf("esp32link: STA_ACK status %u\n", sta_status);
		break;

	case ZNIC_LINK:
		if (rx_msg_len >= 1)
			link_up = rx_msg[0] ? 1 : 0;
		if (rx_msg_len >= 2)
			last_rssi = (int8_t)rx_msg[1];
		if (rx_msg_len >= 3)
			last_reason = rx_msg[2];
		if (rx_msg_len >= 4)
			last_scan = rx_msg[3];
		if (rx_msg_len >= 8)
			sta_ip = ((uint32_t)rx_msg[4] << 24) | ((uint32_t)rx_msg[5] << 16)
				| ((uint32_t)rx_msg[6] << 8) | rx_msg[7];
		if (link_up)
			printf("esp32link: LINK up rssi=%d ip=%lu.%lu.%lu.%lu\n",
				last_rssi, (sta_ip >> 24) & 0xff, (sta_ip >> 16) & 0xff,
				(sta_ip >> 8) & 0xff, sta_ip & 0xff);
		else
			printf("esp32link: LINK down reason=%u scan=%u\n",
				last_reason, last_scan);
		/* Leave the DHCP address on the SD so a headless board (no
		 * HDMI, no serial console) can still be found: pull the card
		 * and read NET.IP. LINK can repeat as a poll reply, so only
		 * rewrite on an actual state change -- never on every poll. */
		{
			static uint32_t ip_on_card = 0;
			static int up_on_card = -1;
			if (link_up != up_on_card ||
			    (link_up && sta_ip != ip_on_card)) {
				char line[24];
				int n;
				if (link_up)
					n = snprintf(line, sizeof line,
						"%lu.%lu.%lu.%lu\n",
						(sta_ip >> 24) & 0xff, (sta_ip >> 16) & 0xff,
						(sta_ip >> 8) & 0xff, sta_ip & 0xff);
				else
					n = snprintf(line, sizeof line, "down\n");
				if (n > 0)
					fs_write_file("NET.IP", line, n);
				ip_on_card = sta_ip;
				up_on_card = link_up;
			}
		}
		if (phase == PH_WAIT_LINK)
			phase = PH_DONE;
		break;

	case ZNIC_LOG:	/* one ESP_LOG line from the firmware */
		logs_rx++;
		printf("esp32: %.*s\n", (int)rx_msg_len, (const char *)rx_msg);
		/* screend.c announces its WebSocket clients here and nowhere
		 * else -- see viewer_present() above. */
		{
			int at = msg_find(rx_msg, rx_msg_len, "viewer connected");
			if (at >= 0) {
				viewer_add(msg_fd(rx_msg, rx_msg_len, at));
				/* its shadow is whatever we last streamed, which may
				 * be nothing at all: start from a whole frame */
				screen_reset();
			} else if ((at = msg_find(rx_msg, rx_msg_len, "viewer gone")) >= 0) {
				viewer_del(msg_fd(rx_msg, rx_msg_len, at));
			}
		}
		break;

