machdyne/zeitlos/sw/apps/net/esp32link.c
	case ZNIC_DATA:
		data_rx++;
		/* a conversation is live -- keep polling every tick until it
		 * has been quiet for LINK_BUSY_HOLD (see poll_gap()) */
		link_busy_tick = z_uptime_ticks();
		if (rx_count < RX_RING) {
			memcpy(rx_data[rx_head], rx_msg, rx_msg_len);
			rx_data_len[rx_head] = rx_msg_len;
			rx_head = (rx_head + 1) % RX_RING;
			rx_count++;
		} else {
			data_dropped++;
		}
		break;

	case ZNIC_NOP:
		nops_rx++;
		break;
	case ZNIC_MOUSE:
		/* {x_lo,x_hi,y_lo,y_hi,buttons} -> the virtual mouse register.
		 * Bit 7 of buttons = pointer left the visor: drop present so
		 * USB is not latched. Otherwise set present (rtl/sysctl.v;
		 * wm reads it like a USB mouse) and refresh the hold timer. */
		if (rx_msg_len >= 5) {
			uint32_t x = (uint32_t)rx_msg[0] | ((uint32_t)rx_msg[1] << 8);
			uint32_t y = (uint32_t)rx_msg[2] | ((uint32_t)rx_msg[3] << 8);
			uint32_t b = rx_msg[4];
			viewer_input();
			if (b & 0x80) {
				vmouse_release();
			} else {
				reg_vmouse = (1u << 24) | ((b & 7) << 20)
					| ((y & 0x3ff) << 10) | (x & 0x3ff);
				vmouse_last_tick = z_uptime_ticks();
				vmouse_held = 1;
				input_events++;
				z_wm_wake();
			}
		}
		break;
	case ZNIC_INPUT:
		if (rx_msg_len >= 3) {
			viewer_input();
			uint32_t ev = (((uint32_t)rx_msg[1] & 0xff) << 9)
				| (((uint32_t)rx_msg[0] & 0xff) << 1)
				| (rx_msg[2] ? 1u : 0u);
			hid_inject((int32_t)ev);
			input_events++;
		}
		break;
	case ZNIC_BURST:
		/* container marker: the frames it announces follow in the
		 * stream and are read by whoever is draining it */
		break;
	case ZNIC_DATA_ACK:
		if (tx_outstanding)
			tx_outstanding--;
		break;

	default:	/* DATA_ACK, unknown */
		break;
	}
}

static int znic_send_sta(const netcfg_t *cfg)
{
	/* One (ssid_len, ssid, psk_len, psk) tuple per configured network,
	 * in NET.CFG order. The firmware scans and takes the first one
	 * that exists; a single-network payload is byte-identical to what
	 * this always sent. */
	static uint8_t body[NETCFG_WIFI_MAX * (2 + NETCFG_SSID_MAX + NETCFG_PSK_MAX)];
	uint16_t off = 0;
	for (int i = 0; i < cfg->n_wifi; i++) {
		uint8_t sl = (uint8_t)strlen(cfg->wifi[i].ssid);
		uint8_t pl = (uint8_t)strlen(cfg->wifi[i].psk);
		body[off++] = sl;
		memcpy(body + off, cfg->wifi[i].ssid, sl);
		off += sl;
		body[off++] = pl;
		memcpy(body + off, cfg->wifi[i].psk, pl);
		off += pl;
	}
	sta_acked = 0;
	sta_sent_tick = z_uptime_ticks();
	sta_tries++;
	int t = znic_xfer(ZNIC_STA, body, off, REPLY_TICKS, ZNIC_STA_ACK);
	printf("esp32link: STA sent, %d network(s) (try %d)\n",
		cfg->n_wifi, sta_tries);
	if (t >= 0)
		znic_dispatch();
	return t;
}

/* ---- PHY API ----------------------------------------------------- */

bool esp32link_init(const uint8_t mac[6])
{
	(void)mac;
	hello_ok = 0;
	hello_count = 0;
	peer_fw = 0;
	peer_rst = 0;
	sta_acked = 0;
	sta_status = 0xff;
	link_up = 0;
	last_rssi = 0;
	last_reason = 0;
	last_scan = 0;
	crc_errors = 0;
	data_dropped = 0;
	polls_sent = 0;
	polls_unanswered = 0;
	nops_rx = 0;
	logs_rx = 0;
	data_rx = 0;
	late_rx = 0;
	fifo_overruns = 0;
	rx_head = rx_tail = rx_count = 0;
	phase = PH_HELLO;
	viewers = 0;
	viewer_input_seen = 0;
	sta_tries = 0;
	link_timeout_reported = 0;
	last_poll_tick = 0;
	link_busy_tick = 0;
	poll_productive = 0;

	uart1_init();
	reg_esp32rx_flush = 1;

	/* gpio0=1, en=0 then en=1 so the ESP32 boots from flash */
	reg_esp32_ctl = ESP32_CTL_GPIO0;
	delay_ms(20);
	reg_esp32_ctl = ESP32_CTL_GPIO0 | ESP32_CTL_EN;

	/* Do not block here: HELLO/STA/LINK are collected by the main
	 * loop's polls. */
	printf("esp32link: ESP32 released, HELLO/STA in main loop\n");
	fflush(stdout);
	return true;
}

int esp32link_hello_ok(void)
{
	return hello_ok;
}

int esp32link_link_is_up(void)
{
	return link_up;
}

void esp32link_poll_wifi(const netcfg_t *cfg)
{
	if (!cfg || !cfg->n_wifi)
		return;

	vmouse_release_if_stale();
	screen_set_viewer(viewer_present());

	switch (phase) {

	case PH_HELLO:	/* HELLO arrives as a poll reply (recv) */
		if (hello_ok)
			phase = PH_SEND_STA;
		break;

	case PH_SEND_STA:
		if (sta_tries && z_uptime_ticks() - sta_sent_tick < STA_RETRY_GAP)
			break;
		if (sta_tries >= STA_MAX_TRIES) {
			printf("esp32link: no STA_ACK after %d tries, giving up\n",
				sta_tries);
			esp32link_debug_dump();
			phase = PH_DONE;
			break;
		}
		if (znic_send_sta(cfg) == ZNIC_STA_ACK) {
			link_timeout_reported = 0;
			phase = PH_WAIT_LINK;
		}
		break;

	case PH_WAIT_LINK:	/* LINK arrives as a poll reply (recv) */
		if (!link_timeout_reported &&
				z_uptime_ticks() - sta_sent_tick > LINK_TIMEOUT) {
			printf("esp32link: no LINK %us after STA (still listening)\n",
				LINK_TIMEOUT / TICKS_PER_SEC);
			esp32link_debug_dump();
			link_timeout_reported = 1;
		}
		break;

	default:	/* PH_DONE */
		break;
	}
}

static uint32_t poll_gap(void)
{
	if (!hello_ok)
		return PROBE_INTERVAL;	/* the ESP32 may still be booting */
	if (phase != PH_DONE)
		return POLL_GAP_BUSY;	/* HELLO/STA_ACK/LINK are poll replies */
	if ((z_uptime_ticks() - link_busy_tick) < LINK_BUSY_HOLD)
		return POLL_GAP_BUSY;
	return POLL_GAP_IDLE;
}

/* Ticks until this link wants the loop again; 0 = now. net's idle wait
 * sleeps on it (with screen_idle_ticks()), so the process is out of the
 * runnable set in between instead of waking 732 times a second. */
uint32_t esp32link_idle_ticks(void)
{
	uint32_t gap, gone;
	if (rx_data_pending || poll_productive)
		return 0;
	gap = poll_gap();
	gone = z_uptime_ticks() - last_poll_tick;
	return gone >= gap ? 0 : gap - gone;
}

uint16_t esp32link_recv(uint8_t *buf, uint16_t maxlen)
{
	/* Whatever the ESP32 pushed on its own -- browser input, DATA_ACK,
	 * a reply that arrived after we stopped waiting for it -- is in the
	 * FIFO already, and this is what the ETH interrupt woke us for.
	 * Costs one MMIO read when there is nothing. */
	znic_drain();

	if (!rx_data_pending && esp32link_idle_ticks() == 0) {
		last_poll_tick = z_uptime_ticks();
		polls_sent++;
		/* how many frames we can take right now: ring slots and FIFO
		 * space, worst-case MTU each. At least 1; more turns the
		 * reply into a BURST. */
		uint32_t room = ((1u << 13) - rx_avail()) / (ZNIC_MAX_PAYLOAD + 8);
		uint32_t slots = RX_RING - rx_count;
		uint8_t credit = (uint8_t)((room < slots ? room : slots));
		if (credit < 1)
			credit = 1;
		if (credit > 15)
			credit = 15;
		int t = znic_xfer(ZNIC_RX_POLL, &credit, 1,
			hello_ok ? REPLY_TICKS : PROBE_TICKS, 0);
		if (t < 0) {
			polls_unanswered++;
			poll_productive = 0;
			return 0;
		}
		/* NOP is the ESP32 saying both its queues are empty. Anything
		 * else means it had something, so there may be more behind it
		 * and the next poll should not wait out a gap -- that is what
		 * keeps a TFTP transfer at wire speed, and what drains a burst
		 * of firmware log lines before the 48-slot queue overflows. */
		poll_productive = 0;
		if (rx_msg_type == ZNIC_BURST) {
			uint8_t n = rx_msg_len >= 1 ? rx_msg[0] : 0;
			bursts_rx++;
			for (uint8_t i = 0; i < n; i++) {
				if (!znic_rx_raw(REPLY_TICKS))
					break;
				if (rx_msg_type != ZNIC_NOP)
					poll_productive = 1;
				znic_dispatch();
			}
		} else {
			poll_productive = (rx_msg_type != ZNIC_NOP);
			znic_dispatch();
		}
	}
	if (!rx_data_pending)
		return 0;

	uint16_t n = rx_data_len[rx_tail];
	if (n > maxlen)
		n = maxlen;
	memcpy(buf, rx_data[rx_tail], n);
	rx_tail = (rx_tail + 1) % RX_RING;
	rx_count--;
	return n;
}

