machdyne/zeitlos/sw/apps/net/esp32link.c
int esp32link_pump_input(void)
{
	uint32_t before = input_events;
	znic_drain();
	return (int)(input_events - before);
}

int esp32link_vmouse_buttons(void)
{
	if (!vmouse_held)
		return 0;
	return (int)((reg_vmouse >> 20) & 7);
}


bool esp32link_send(const uint8_t *buf, uint16_t len)
{
	if (len > ZNIC_MAX_PAYLOAD)
		return false;
	/* Never block net's main loop here: it is the same loop that polls
	 * the link for keyboard/mouse input, and waiting tens of ms for a
	 * DATA_ACK (the old behaviour) dropped that poll rate to ~17Hz and
	 * made the remote desktop lag by ~1s. znic_drain() has already
	 * collected any acks that arrived; if the window is still full the
	 * oldest frames are presumed lost (an ethernet link may drop, and
	 * TCP/TFTP retransmit) and we send immediately. */
	znic_drain();
	if (tx_outstanding >= ZNIC_TX_WINDOW) {
		tx_lost += tx_outstanding;
		tx_outstanding = 0;
	}
	znic_tx_raw(ZNIC_DATA, buf, len);
	tx_outstanding++;
	return true;
}

void esp32link_debug_dump(void)
{
	printf("esp32link: hello=%d(#%d) fw=%u rst=%u sta_ack=%d status=%u link=%d "
		"rssi=%d phase=%d polls=%lu unanswered=%lu nops=%lu logs=%lu "
		"data=%lu late=%lu crc_err=%lu dropped=%lu fifo=%lu ovr=%lu "
		"bursts=%lu txout=%lu txlost=%lu ctl=0x%lx\n",
		hello_ok, hello_count, peer_fw, peer_rst, sta_acked, sta_status,
		link_up, last_rssi, phase, (unsigned long)polls_sent,
		(unsigned long)polls_unanswered, (unsigned long)nops_rx,
		(unsigned long)logs_rx, (unsigned long)data_rx,
		(unsigned long)late_rx, (unsigned long)crc_errors,
		(unsigned long)data_dropped, (unsigned long)rx_avail(),
		(unsigned long)fifo_overruns, (unsigned long)bursts_rx,
		(unsigned long)tx_outstanding, (unsigned long)tx_lost,
		(unsigned long)reg_esp32_ctl);
}
